import React from "react"
import styled from "styled-components"
import { useStaticQuery, graphql } from "gatsby"
import Img from "gatsby-image"

const HeroSection = () => {
  const data = useStaticQuery(graphql`
    query {
      image1: file(relativePath: { eq: "onama1.png" }) {
        childImageSharp {
          fluid(maxWidth: 600, quality: 100) {
            ...GatsbyImageSharpFluid_withWebp_tracedSVG
          }
        }
      }
    }
  `)

  return (
    <>
      <Hero>
        <div className="lead">
          <h1>О нама</h1>
          <p>
            Наш вртић је предшколска установа верификована од стране
            Министранства просвјете и културе Републике Српске, усмјерена ка
            пружању његе и подршци при образовању и васпитању дјеце од јаслица
            до предшколског узраста.
          </p>
          <p>
            Смјештени смо у самом центру Пала, а објекат је намјенски грађен за
            потребе вртића,од чврстог материјала и у потпуности одговара
            намјени. Велику пажњу поклањамо квалитету средине у којој дјеца
            бораве. Васпитно-образовни рад са дјецом организован је у савремено
            опремљеним просторијама на преко 650 м². Објекат је покривен видео
            надзором и у потпуности климатизован и садржи: седам радних соба за
            рад са дјецом, простор за заједничке активности, гардеробере,
            санитарне просторе за дјецу, санитарни простор за одрасле, савремено
            опремљену кухињу, трпезарију.
          </p>
          <p>
            Такође, за потребе дјеце урађен је и прилагођен њиховим потребама
            простор на отвореном, односно двориште које се простире на преко
            5000 м². У нашем дворишту централно мјесто заузима игралиште за
            дјецу са тобоганима, бројним клацкалицама, љуљашкама, вртешкама,
            пјешчаником и пењалицама. Један дио дворишта чини травната површина
            на којој се налази терен за фудбал и друге разне спортске
            активности.
          </p>
          <p>
            Све што радимо у нашем вртићу оријентисано је ка свеобухватном
            развоју малишана од најранијег дјетињства. То постижемо путем нашег
            динамичног програма за предшколско образовање, који спроводи
            квалификовано особље заједно са стручним сарадником, водећи притом
            рачуна да потребе сваког појединачног дјетета буду испуњене.
          </p>
        </div>
        <div className="image">
          <Img fluid={data.image1.childImageSharp.fluid} />
        </div>
      </Hero>
      {/*
      <Hero style={{ backgroundColor: "#3A9A9F" }}>
        <div className="parents">
          <h1>Савјет родитеља</h1>
          <p>
            Родитељи чија дјеца похађају цјелодневни боравак у вртићу имају
            право да оснују Савјет родитеља. Савјет родитеља по правилу одржава
            националну структуру дјеце у вртићу и једнаку заступљеност полова.
          </p>
          <ul>
            Савјет родитеља обавља сљедеће послове :
            <li>Залаже се за права и интересе дјеце,</li>
            <li>
              Промовише интересе предшколске установе у јединици локалне
              заједнице,
            </li>
            <li>Презентује ставове родитеља Управном одбору вртића,</li>
            <li>Подстиче ангажман родитеља у раду вртића,</li>
            <li>
              Информише Управни одбор о својим ставовим када оцијени да је то
              потребно, или на захтјев Управног одбора, о сваком питању које се
              односи на рад прешколске установе,
            </li>
            <li>Кандидује представника родитеља у Управни одбор.</li>
          </ul>
          <p>
            Савјет родитеља своје приједлоге, питања и ставове упућује Управном
            одбору, директору и стручним органима вртића. Савјет родитеља доноси
            пословник о раду Савјета родитеља и бира предсједника.
          </p>
          <p>
            Предсједник Савјета родитеља у договору са директором вртића
            заказује састанке Савјета родитеља, одређује дневни ред и термин
            одржвања састанака. Састанци Савјета родитеља су јавни и њима могу
            присуствовати чланови Стручног вијећа и родитељи који су
            заинтересовани за одређену проблематику која се налази на дневном
            реду.
          </p>
          <p>
            Чланови Стручног вијећа и родитељи који желе присуствовати састанку
            Савјета родитеља морају се претходно најавити предсједнику Савјета
            родитеља и немају право одлучивања.
          </p>
          <p>
            Одлуке Савјета родитеља се доносе јавним изјашњавањем већине од
            присутних чланова Савјета родитеља.
          </p>
        </div>
      </Hero>
      */}
    </>
  )
}

export default HeroSection

const Hero = styled.section`
  background-color: #ffec89;
  color: #ff0066;
  display: flex;
  justify-content: space-evenly;
  align-items: center;
  min-height: 90vh;
  flex-wrap: wrap;
  padding: 150px 10px 75px 10px;
  z-index: 0;
  .lead,
  .parents {
    padding: 20px;
    > * {
      margin: 20px 0;
    }
    h1 {
      font-size: 36px;
    }
    p,
    li {
      max-width: 700px;
      padding: 0 10px;
      text-align: justify;
    }
  }
  .parents {
    background-color: #fff;
    border-radius: 25px;
    box-shadow: 8px 8px 16px rgba(0, 0, 0, 0.15);
  }
  .image {
    max-width: 40vw;
    width: 600px;
  }
  @media screen and (max-width: 1024px) {
    .image {
      max-width: 70vw;
    }
  }
`
